In [1]:
import pandas as pd

In [2]:
#k key:value 쌍으로 딕셔너리 만들고, 변수 지정

dict_data = {'a': 'APPLE', 'b':'BANANA', 'c':'CARROT'}

# 판다스 Series() 함수로 dictionary 를 Series로 변환->변수 지정

sr  = pd.Series(dict_data)   #딕셔너리 -> 시리즈 변환 :  pandas.Series(딕셔너리)

print(type(sr))
print('\n')  # 한줄 띄우기 
print(sr)  # key값->index

<class 'pandas.core.series.Series'>


a     APPLE
b    BANANA
c    CARROT
dtype: object

In [3]:
list_data = ['2022-02-26', 3.14, 'abc', 100, True]
sr2 = pd.Series(list_data)
print(sr2)

0    2022-02-26
1          3.14
2           abc
3           100
4          True
dtype: object

In [4]:
idx = sr2.index
val = sr2.values
print(idx,val, end="")

RangeIndex(start=0, stop=5, step=1) ['2022-02-26' 3.14 'abc' 100 True]

In [5]:
idx2 = sr.index
val2 = sr.values
print(idx2,val2,end = "")

Index(['a', 'b', 'c'], dtype='object') ['APPLE' 'BANANA' 'CARROT']

In [6]:
print(sr,sr2)

a     APPLE
b    BANANA
c    CARROT
dtype: object 0    2022-02-26
1          3.14
2           abc
3           100
4          True
dtype: object

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3],[7,8,9],[4,5,6],[3,5,10]])

In [3]:
df

   0  1   2
0  1  2   3
1  7  8   9
2  4  5   6
3  3  5  10

In [4]:
df.columns = ["A","B","C"]
df

   A  B   C
0  1  2   3
1  7  8   9
2  4  5   6
3  3  5  10

In [6]:
int(4.5)

4

In [7]:
df.columns[1]

'B'

In [8]:
df.sort_values(df.columns[1])

   A  B   C
0  1  2   3
2  4  5   6
3  3  5  10
1  7  8   9